bun-app/artillery.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  phases:
    - duration: 10 # Duration of phase
      arrivalRate: 5 # User count to start with
      rampTo: 10
      name: Warm up the API
    - duration: 10 
      arrivalRate: 10
      rampTo: 50
      name: Ramp up to peak load
    - duration: 10 
      arrivalRate: 50
      name: Sustained peak load

scenarios:
  - name: Get Hello World
    flow:
      - loop:
        - get:
            url: "/"
        count: 100